Revit 2027 API
ParameterTypeId.MepAnalyticalElecApparentPowerRating Property
 "Apparent Power Rating"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId MepAnalyticalElecApparentPowerRating { get; }
Public Shared ReadOnly Property MepAnalyticalElecApparentPowerRating As ForgeTypeId
	Get
public:
static property ForgeTypeId^ MepAnalyticalElecApparentPowerRating {
	ForgeTypeId^ get ();
}
static member MepAnalyticalElecApparentPowerRating : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace